Catalogs/ЛичныеКонтакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ЛичныеКонтакты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминатьОДнеРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДоНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляОграниченияПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МодульРегламентныхЗаданий/Ext/Module.bsl
Процедура ВыполнитьОбменДаннымиДляНастройкиОбмена(КодНастройки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.НастройкиОбменаДанными.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена)
		ИЛИ НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ПроцедурыОбменаДанными.ВыполнитьОбменДаннымиПоПроизвольнойНастройке(НастройкаОбмена, Ложь);
			
КонецПроцедуры

Процедура ВыполнитьОтложенныеДвиженияДляНастройкиОбмена(КодНастройки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.НастройкиОбменаДанными.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена)
		ИЛИ НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;	
	
	ПроцедурыОбменаДанными.ВыполнитьОтложенныеДвиженияПоНастройкеОбмена(НастройкаОбмена);
			
КонецПроцедуры

Процедура ВыполнитьОбменДаннымиДляНастройкиАвтоматическогоОбменаДанными(КодНастройки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.НастройкиВыполненияОбмена.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена)
		ИЛИ НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ПроцедурыОбменаДанными.ВыполнитьОбменПоНастройкеАвтоматическогоВыполненияОбменаДанными(НастройкаОбмена, Ложь);
	
КонецПроцедуры


// Процедура выполняет пересчет регистров накопления, для удаления нулевых записей
Процедура ПересчетИтоговРегистровНакопления() Экспорт

	НаДату = НачалоМесяца(ТекущаяДата())-1;	
	ПересчетРегистров(РегистрыНакопления, НаДату, Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки);
	ПересчетРегистров(РегистрыБухгалтерии, НаДату);	
	
КонецПроцедуры

Процедура ПересчетРегистров(МенеджерРегистров, НаДату, ОграничениеПоВидуРегистра = Неопределено)
	
	Для Каждого МенеджерРегистра ИЗ МенеджерРегистров Цикл
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерРегистра));
		
		Если ОграничениеПоВидуРегистра <> Неопределено И МетаданныеРегистра.ВидРегистра <> ОграничениеПоВидуРегистра Тогда
			Продолжить;
		КонецЕсли;
		ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату)
	
	Если МенеджерРегистра.ПолучитьПериодРассчитанныхИтогов()<НаДату Тогда
		МенеджерРегистра.УстановитьПериодРассчитанныхИтогов(НаДату);
	Иначе
		МенеджерРегистра.ПересчитатьИтоги();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеИндексаПолнотекстовогоПоиска() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		
		Если НЕ ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			Попытка	
				ЗаписьЖурналаРегистрации(НСтр("ru='Полнотекстовое индексирование';uk='Повнотекстове індексування'"), 
				УровеньЖурналаРегистрации.Информация, , ,
				НСтр("ru='Начато регламентное индексирование порции';uk='Почато регламентне індексування порції'"));
				
				ПолнотекстовыйПоиск.ОбновитьИндекс(Ложь, Истина);
				
				ЗаписьЖурналаРегистрации(НСтр("ru='Полнотекстовое индексирование';uk='Повнотекстове індексування'"), 
				УровеньЖурналаРегистрации.Информация, , ,
				НСтр("ru='Закончено регламентное  индексирование порции';uk='Закінчено регламентне  індексування порції'"));
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru='Полнотекстовое индексирование';uk='Повнотекстове індексування'"), 
				УровеньЖурналаРегистрации.Ошибка, , ,
				НСтр("ru='Во время регламентного обновления индекса произошла неизвестная ошибка: ';uk='Під час регламентного оновлення індексу сталася невідома помилка: '") + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
Конецпроцедуры

Процедура СлияниеИндексаПолнотекстовогоПоиска() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		
		Попытка	
			ЗаписьЖурналаРегистрации(НСтр("ru='Полнотекстовое индексирование';uk='Повнотекстове індексування'"), 
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru='Начато регламентное слияние индексов';uk='Почато регламентне злиття індексів'"));
				
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
				
			ЗаписьЖурналаРегистрации(НСтр("ru='Полнотекстовое индексирование';uk='Повнотекстове індексування'"), 
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru='Закончено регламентное слияние индексов';uk='Закінчено регламентне злиття індексів'"));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru='Полнотекстовое индексирование';uk='Повнотекстове індексування'"), 
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru='Во время регламентного слияния индекса произошла неизвестная ошибка: ';uk='Під час регламентного злиття індексу сталася невідома помилка: '") + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
Конецпроцедуры

// Функция выделяет необходимые части из строки запуска
//
Функция ВыделитьПодстрокуСтрокиЗапуска(СтрокаЗапуска, КлючПодстроки)

	НомерПервогоСимвола = Найти(ВРег(СтрокаЗапуска), ВРег(КлючПодстроки)) + СтрДлина(КлючПодстроки);
	Для Счетчик = НомерПервогоСимвола По СтрДлина(СтрокаЗапуска) Цикл
		Если Сред(СтрокаЗапуска, Счетчик, 1) = ";" Тогда
			НомерПоследнегоСимвола = Счетчик - 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Получаем искомую подстроку
	ИскомаяПодстрока = Сред(СтрокаЗапуска, НомерПервогоСимвола, (НомерПоследнегоСимвола - НомерПервогоСимвола + 1));
	Если Сред(ИскомаяПодстрока, 1, 1) = """" Тогда
		// Если подстрока в кавычках, то выделяем их
		ИскомаяПодстрока = Сред(ИскомаяПодстрока, 2, (СтрДлина(ИскомаяПодстрока) - 2));
	КонецЕсли;
	
	Возврат ИскомаяПодстрока;

КонецФункции // ВыделитьПодстроку()

// Процедура производит действия, приводящие к регламетному обновлению ИБ,
// но только для серверного варианта
Процедура ОбновлениеКонфигурации() Экспорт

	СтруктураОбновленияИБ = Константы.НастройкаОбновленияКонфигурации.Получить().Получить();
	Если ТипЗнч(СтруктураОбновленияИБ) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию Тогда
		ФайлОбновления = Константы.ФайлКонфигурацииДляОбновления.Получить().Получить();
		Если ТипЗнч(ФайлОбновления) = Тип("ДвоичныеДанные") Тогда
			ПутьКФайлу = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".cf";
			ФайлОбновления.Записать(ПутьКФайлу);
			СтруктураОбновленияИБ.Вставить("ФайлОбновленияКонфигурации", ПутьКФайлу);
			СтруктураОбновленияИБ.Вставить("ОписаниеФайлаОбновленияКонфигурации", Константы.ОписаниеФайлаКонфигурацииДляОбновления.Получить());
		Иначе
			СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Если СтрЧислоВхождений(ВРег(СтрокаСоединения), "FILE=") Тогда
		Возврат;
	КонецЕсли;
	
	СтрДлина = СтрДлина(СтрокаСоединения);
	
	// Ищем имя сервера
	СтрокаСервера = ВыделитьПодстрокуСтрокиЗапуска(СтрокаСоединения, "Srvr=");
	// Если в имени сервера присутствует имя порта, то выделяем его
	РазделительПорта = Найти(СтрокаСервера, ":");
	Если РазделительПорта > 0 Тогда
		ИмяСервера = Сред(СтрокаСервера, 1, (РазделительПорта - 1));
		НомерПортаКластера = Сред(СтрокаСервера, (РазделительПорта + 1));
	Иначе
		ИмяСервера = СтрокаСервера;
		ком = Новый COMОбъект(УправлениеСоединениямиИБ.ИмяCOMСоединителя());
		НомерПортаКластера = ком.RMngrPortDefault;
	КонецЕсли; 
	
	// Ищем имя ИБ
	ИмяИБ = ВыделитьПодстрокуСтрокиЗапуска(СтрокаСоединения, "Ref=");
	
	ТекстСообщенияБлокировки = СтруктураОбновленияИБ.СообщениеОБлокировкеИБ;
	ПараметрБлокировки = СтруктураОбновленияИБ.ПараметрБлокировкиИБ;
	ИмяАдминистратораКластера = СтруктураОбновленияИБ.ИмяАдминистратораКластера;
	ПарольАдминистратораКластера = СтруктураОбновленияИБ.ПарольАдминистратораКластера;
	ИмяАдминистратораИБ = СтруктураОбновленияИБ.ИмяАдминистратораИБ;
	ИсполняемыйФайлКлиентаНаСервере = СтруктураОбновленияИБ.ИсполняемыйФайлКлиентаНаСервере;
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяАдминистратораИБ);
	НовыйПароль = Лев(Строка(Новый УникальныйИдентификатор), 20);
	Пользователь.Пароль = НовыйПароль;
	Пользователь.Записать();
	ПарольАдминистратораИБ = НовыйПароль;
	
	ПутьКФайлуЖурнала = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".txt";
	
	ШаблонТекста = ПолучитьОбщийМакет("МакетФайлаОбновленияКонфигурации");
	
	КонечныйТекст = ШаблонТекста.ПолучитьОбласть("ОбластьДоОбновленияКонфигурации");
	КонечныйТекст.УдалитьСтроку(1);
	КонечныйТекст.УдалитьСтроку(КонечныйТекст.КоличествоСтрок());
	Если СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию Тогда
		ПромТекст = ШаблонТекста.ПолучитьОбласть("ОбластьЗагрузкиИзмененнойКонфигурации");
		ПромТекст.УдалитьСтроку(1);
		ПромТекст.УдалитьСтроку(ПромТекст.КоличествоСтрок());
		КонечныйТекст.УстановитьТекст(КонечныйТекст.ПолучитьТекст() + ПромТекст.ПолучитьТекст());
	КонецЕсли;
	Если СтруктураОбновленияИБ.ОбновлятьКонфигурациюИБ Тогда
		ПромТекст = ШаблонТекста.ПолучитьОбласть("ОбластьОбновленияКонфигурацииБД");
		ПромТекст.УдалитьСтроку(1);
		ПромТекст.УдалитьСтроку(ПромТекст.КоличествоСтрок());
		КонечныйТекст.УстановитьТекст(КонечныйТекст.ПолучитьТекст() + ПромТекст.ПолучитьТекст());
	КонецЕсли;
	ПромТекст = ШаблонТекста.ПолучитьОбласть("ОбластьПослеОбновленияКонфигурации");
	ПромТекст.УдалитьСтроку(1);
	ПромТекст.УдалитьСтроку(ПромТекст.КоличествоСтрок());
	КонечныйТекст = КонечныйТекст.ПолучитьТекст() + ПромТекст.ПолучитьТекст();
	
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ServerName]", """" + ИмяСервера + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[KlasterPortNumber]", СтрЗаменить(Строка(НомерПортаКластера), Символы.НПП, ""));
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[InfoBaseName]", """" + ИмяИБ + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[LockMessageText]", """" + ТекстСообщенияБлокировки + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[LockPermissionCode]", """" + ПараметрБлокировки + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ClasterAdminName]", """" + ИмяАдминистратораКластера + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ClasterAdminPass]", """" + ПарольАдминистратораКластера + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[InfoBasesAdminName]", """" + ИмяАдминистратораИБ + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[InfoBasesAdminPass]", """" + ПарольАдминистратораИБ + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[NewPass]", """" + Лев(Строка(Новый УникальныйИдентификатор), 20) + """");
	
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[TimeBeginLock]", "CDate(""" + Формат((ТекущаяДата() + 60*5), "ДФ=""дд/ММ/гггг ЧЧ:мм:сс""") + """)");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[TimeEndLock]", "CDate(""" + Формат((ТекущаяДата() + 60*5 + 60*60*2), "ДФ=""дд/ММ/гггг ЧЧ:мм:сс""") + """)");
	
	Если СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию Тогда
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[Cfg]", """" + СтруктураОбновленияИБ.ФайлОбновленияКонфигурации + """");
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ОписаниеФайлаОбновленияКонфигурации]", """" + СтруктураОбновленияИБ.ОписаниеФайлаОбновленияКонфигурации + """");
	Иначе
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[Cfg]", """" + "" + """");
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ОписаниеФайлаОбновленияКонфигурации]", """" + "" + """");
	КонецЕсли; 
	Если ТипЗнч(ИсполняемыйФайлКлиентаНаСервере) = Тип("Строка") И НЕ ПустаяСтрока(ИсполняемыйФайлКлиентаНаСервере) Тогда
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[v8exe]", """" + ИсполняемыйФайлКлиентаНаСервере + """");
	Иначе
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[v8exe]", """" + КаталогПрограммы() + "1cv8.exe" + """");
	КонецЕсли; 
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[Out]", """" + ПутьКФайлуЖурнала + """");

	ИмяВременногоФайла = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".vbs";
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[FilePath]", """" + ИмяВременногоФайла + """");
	
	Скрипт = Новый ТекстовыйДокумент;
	Скрипт.Вывод = ИспользованиеВывода.Разрешить;
	Скрипт.УстановитьТекст(КонечныйТекст);
	Скрипт.Записать(ИмяВременногоФайла, КодировкаТекста.Системная);
	
	Ком = Новый COMObject("wScript.Shell");
	Ком.Run("""" + ИмяВременногоФайла + """");
	
КонецПроцедуры

// Процедура формирует задачи о необходимости поздравить с днем рождения
//
Процедура СоздатьЗадачиПоздравленияСДнемРождения() Экспорт
	
	УсловиеЗадачи = УправлениеКонтактами.ПолучитьСтрокуУсловияДР();
	
	Запрос = Новый Запрос;

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контакты.КонтактноеЛицо                             КАК КонтактноеЛицо,
	|	Контакты.Владелец.ОсновнойМенеджерПокупателя        КАК Исполнитель,
	|	Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания КАК ИнтервалДней,
	|	Контакты.КонтактноеЛицо.ДатаРождения                КАК ДатаРождения,
	|	Задачи.СрокИсполнения                               КАК Срок
	|ИЗ
	|	Справочник.КонтактныеЛицаКонтрагентов КАК Контакты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Задача.ЗадачиПользователя КАК Задачи
	|ПО
	|	Задачи.Объект = Контакты.КонтактноеЛицо
	|	И Задачи.Оповещение = ИСТИНА
	|	И Задачи.СрокИсполнения > ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, РАЗНОСТЬДАТ(Контакты.КонтактноеЛицо.ДатаРождения, ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания), МЕСЯЦ)/12 - 1)
	|	И Задачи.ПамятнаяДата = ИСТИНА
	|ГДЕ
	|	Контакты.КонтактноеЛицо.НапоминатьОДнеРождения = ИСТИНА
	|	И Контакты.Владелец ССЫЛКА Справочник.Контрагенты
	|	И Контакты.Владелец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И Контакты.Владелец.ОсновнойМенеджерПокупателя <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И ((ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) >= &ТекДата
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ДЕНЬ, -(Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) <= &ТекДата)
	|	ИЛИ (ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) >= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ДЕНЬ, -(Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) <= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)))
	|	И Задачи.СрокИсполнения ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЛичныеКонтакты.Ссылка,
	|	ЛичныеКонтакты.ПользовательДляОграниченияПравДоступа,
	|	ЛичныеКонтакты.КоличествоДнейДоНапоминания,
	|	ЛичныеКонтакты.ДатаРождения,
	|	Задачи.СрокИсполнения
	|ИЗ
	|	Справочник.ЛичныеКонтакты КАК ЛичныеКонтакты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Задача.ЗадачиПользователя КАК Задачи
	|ПО
	|	Задачи.Объект = ЛичныеКонтакты.Ссылка
	|	И Задачи.Оповещение = ИСТИНА
	|	И Задачи.СрокИсполнения > ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, РАЗНОСТЬДАТ(ЛичныеКонтакты.ДатаРождения, ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, ЛичныеКонтакты.КоличествоДнейДоНапоминания), МЕСЯЦ)/12 - 1)
	|	И Задачи.ПамятнаяДата = ИСТИНА
	|ГДЕ
	|	ЛичныеКонтакты.НапоминатьОДнеРождения = ИСТИНА
	|	И ЛичныеКонтакты.ПользовательДляОграниченияПравДоступа <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И ((ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) >= &ТекДата
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ДЕНЬ, -(ЛичныеКонтакты.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) <= &ТекДата)
	|	ИЛИ (ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) >= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ДЕНЬ, -(ЛичныеКонтакты.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) <= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)))
	|	И Задачи.СрокИсполнения ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("ТекДата"      , ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий()Цикл
		
		НоваяЗадача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
		НоваяЗадача.Дата           =ТекущаяДата();
		НоваяЗадача.Наименование   = Строка(РезультатЗапроса.КонтактноеЛицо) + ". " + УсловиеЗадачи;
		НоваяЗадача.ПамятнаяДата   = Истина;
		НоваяЗадача.Исполнитель    = РезультатЗапроса.Исполнитель;
		НоваяЗадача.Инициатор      = РезультатЗапроса.Исполнитель;
		НоваяЗадача.СрокИсполнения = Дата(Год(ТекущаяДата() + (РезультатЗапроса.ИнтервалДней * 24 * 60 * 60)), Месяц(РезультатЗапроса.ДатаРождения), День(РезультатЗапроса.ДатаРождения), 00, 00, 00);
		НоваяЗадача.Оповещение     = Истина;
		НоваяЗадача.СрокОповещения = НоваяЗадача.СрокИсполнения - (РезультатЗапроса.ИнтервалДней * 24 * 60 * 60);
		НоваяЗадача.Объект         = РезультатЗапроса.КонтактноеЛицо;
		
		Попытка
			НоваяЗадача.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры // СоздатьЗадачиПоздравленияСДнемРождения()

///////////////////////////////////////////
// Процедуры получения электронных сообщений
//

Процедура ПолучениеЭлектронныхСообщений() Экспорт
	
	Если НЕ Константы.ИспользованиеВстроенногоПочтовогоКлиента.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибок = "";
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(Неопределено, Справочники.Пользователи.ПустаяСсылка(),,,, Истина, Ложь, ТекстОшибок);
	
	Если ПустаяСтрока(ТекстОшибок) Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru='Получение электронных сообщений';uk='Отримання електронних повідомлень'"), 
			УровеньЖурналаРегистрации.Информация, Метаданные.Документы.ЭлектронноеПисьмо, ,
			НСтр("ru='Получение электронных сообщений выполнено успешно';uk='Отримання електронних повідомлень виконано успішно'"));
	Иначе
		ЗаписьЖурналаРегистрации(НСтр("ru='Получение электронных сообщений';uk='Отримання електронних повідомлень'"), 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЭлектронноеПисьмо, ,
			НСтр("ru='Получение электронных сообщений выполнено с ошибками:';uk='Отримання електронних повідомлень виконано з помилками:'") + Символы.ПС + ТекстОшибок);
	КонецЕсли; 
	
КонецПроцедуры
